W8D1/reddit_clone/app/views/posts/edit.html.erb

        name="post[sub_ids][]"
        <%= "checked" if @post.sub_ids.include?(sub.id) %>
---
SELECT "subs"."id" FROM "subs" INNER JOIN "sub_posts" ON "subs"."id" = "sub_posts"."sub_id" WHERE "sub_posts"."post_id" = $1  [["post_id", 3]]