W8D1/reddit_clone/app/views/posts/show.html.erb

<ul>
  <% @post.subs.each do |sub| %>
---
SELECT "subs".* FROM "subs" INNER JOIN "sub_posts" ON "subs"."id" = "sub_posts"."sub_id" WHERE "sub_posts"."post_id" = $1  [["post_id", 4]]