W8D1/reddit_clone/app/controllers/application_controller.rb

  def required_moderator_login

    sub = Sub.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]