W8D1/reddit_clone/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "TEst subs checked"], ["url", ""], ["content", "testingsssss"], ["author_id", 3], ["created_at", "2020-02-04 00:25:48.115652"], ["updated_at", "2020-02-04 00:25:48.115652"]]