W8D1/reddit_clone/app/controllers/subs_controller.rb

  def update
    @sub = Sub.find_by(id: params[:id])
    if @sub.update_attributes(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "Nvm Tuesdays suck"], ["description", "Tuesdays!!"], ["updated_at", "2020-02-03 20:03:49.402768"], ["id", 4]]