W7D2/music_app_3/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "4PEI454mKgBAc_Iz7Z4TOA"], ["updated_at", "2020-01-29 00:21:06.406297"], ["id", 1]]
---
    def reset_session_token!

        self.update!(session_token: SecureRandom.urlsafe_base64(16))

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def password=(password)
        self.password_digest = BCrypt::Password.create(password)