W7D2/music_app_3/app/controllers/bands_controller.rb

    def show
        @band = Band.find_by(id: params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" IS NULL LIMIT $1  [["LIMIT", 1]]