W6D3/snoopy/app/controllers/users_controller.rb

  def create
    # render json: params
    user = User.new(params.require(:user).permit(:name, :email))
    if user.save!
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Henry"], ["email", "HENRY@gmail.com"], ["created_at", "2020-01-23 00:56:23.285276"], ["updated_at", "2020-01-23 00:56:23.285276"]]