W8D1/reddit_clone/app/views/shared/_subs_show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
<p>
  Moderator: <%= User.find_by(id: sub.moderator_id).username %>